{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 512, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.1, "input_dtype": "float32", "batch_input_shape": [null, 100, 8960], "input_length": null, "dropout_W": 0.1, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "go_backwards": false, "input_dim": 8960, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 1}}]}
